# Dataquest: Guided Project: Analyzing CIA Factbook Data Using SQL

The data is from the CIA World Factbook and available for download [here](https://dsserver-prod-resources-1.s3.amazonaws.com/257/factbook.db). 

In this project, I will answer the following questions: 


- Which country has the most people? Which country has the highest growth rate?
- Which countries have the highest ratios of water to land? Which countries have more water than land?
- Which countries will add the most people to their populations next year?
- Which countries have a higher death rate than birth rate?
- Which countries have the highest population/area ratio, and how does it compare to list we found in the previous screen?

In [2]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [3]:
%%sql 
SELECT *
    FROM sqlite_master
    WHERE type = 'table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

## Data

In [3]:
%%sql
SELECT *
  FROM facts
 LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

Here are the descriptions for some of the columns:

- name — the name of the country.
- area— the country's total area (both land and water).
- area_land — the country's land area in square kilometers.
- area_water — the country's waterarea in square kilometers.
- population — the country's population.
- population_growth— the country's population growth as a percentage.
- birth_rate — the country's birth rate, or the number of births per year per 1,000 people.
- death_rate — the country's death rate, or the number of death per year per 1,000 people.

## Summary statistics

In [5]:
%%sql
SELECT name
    FROM facts
    WHERE population == (SELECT MIN(population)
                        FROM facts
                        );

 * sqlite:///factbook.db
Done.

[('Antarctica',)]

In [4]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), 
        MAX(population_growth)
    FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [6]:
%%sql
SELECT name
    FROM facts
    WHERE population == (SELECT MAX(population)
                        FROM facts
                        );

 * sqlite:///factbook.db
Done.

[('World',)]

In [10]:
%%sql
SELECT MIN(population), MAX(population),
        MIN(population_growth), MAX(population_growth)
    FROM facts
    WHERE population > (SELECT MIN(population)
                       FROM facts
                       )
    AND name <> 'World';

 * sqlite:///factbook.db
Done.

[(48, 1367485388, 0.0, 4.02)]

In [11]:
%%sql 
SELECT AVG(population), AVG(area)
    FROM facts
    WHERE name <> 'World';

 * sqlite:///factbook.db
Done.

[(32242666.56846473, 555093.546184739)]

## Top 10 Countries with population above average and area below average

In [6]:
%%sql
SELECT *
    FROM facts
    WHERE population > (SELECT AVG(population)
                       FROM facts
                       WHERE name <> 'World'
                       )
    AND area < (SELECT AVG(area)
               FROM facts
                WHERE name <> 'World'
               )
    ORDER BY population DESC;

 * sqlite:///factbook.db
Done.

[(14, 'bg', 'Bangladesh', 148460, 130170, 18290, 168957745, 1.6, 21.14, 5.61, 0.46),
 (85, 'ja', 'Japan', 377915, 364485, 13430, 126919659, 0.16, 7.93, 9.51, 0.0),
 (138, 'rp', 'Philippines', 300000, 298170, 1830, 100998376, 1.61, 24.27, 6.11, 2.09),
 (192, 'vm', 'Vietnam', 331210, 310070, 21140, 94348835, 0.97, 15.96, 5.93, 0.3),
 (65, 'gm', 'Germany', 357022, 348672, 8350, 80854408, 0.17, 8.47, 11.42, 1.24),
 (173, 'th', 'Thailand', 513120, 510890, 2230, 67976405, 0.34, 11.19, 7.8, 0.0),
 (185, 'uk', 'United Kingdom', 243610, 241930, 1680, 64088222, 0.54, 12.17, 9.35, 2.54),
 (83, 'it', 'Italy', 301340, 294140, 7200, 61855120, 0.27, 8.74, 10.19, 4.1),
 (91, 'ks', 'Korea, South', 99720, 96920, 2800, 49115196, 0.14, 8.19, 6.75, 0.0),
 (163, 'sp', 'Spain', 505370, 498980, 6390, 48146134, 0.89, 9.64, 9.04, 8.31),
 (139, 'pl', 'Poland', 312685, 304255, 8430, 38562189, 0.09, 9.74, 10.19, 0.46),
 (182, 'ug', 'Uganda', 241038, 197100, 43938, 37101745, 3.24, 43.79, 10.69, 0.74),
 (80, 'iz', 'Iraq', 438317, 437367, 950, 37056169, 2.93, 31.45, 3.77, 1.62),
 (120, 'mo', 'Morocco', 446550, 446300, 250, 33322699, 1.0, 18.2, 4.81, 3.36)]

In [17]:
%%sql 
SELECT *
    FROM facts
    WHERE name <> 'World'
    AND population == (SELECT MAX(population)
                      FROM facts
                      WHERE name <> 'World'
                      );

 * sqlite:///factbook.db
Done.

[(37, 'ch', 'China', 9596960, 9326410, 270550, 1367485388, 0.45, 12.49, 7.53, 0.44)]

## Top 10 Population Growth

In [36]:
%%sql 
SELECT name, population_growth
    FROM facts
    WHERE name != 'World'
    ORDER BY population_growth DESC
    LIMIT 10;

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02),
 ('Malawi', 3.32),
 ('Burundi', 3.28),
 ('Niger', 3.25),
 ('Uganda', 3.24),
 ('Qatar', 3.07),
 ('Burkina Faso', 3.03),
 ('Mali', 2.98),
 ('Cook Islands', 2.95),
 ('Iraq', 2.93)]

In [15]:
%%sql 
SELECT name, population, population_growth,
        ROUND(CAST(population AS Float)/100*population_growth, 2) AS absolute_growth
    FROM facts
    WHERE name != 'World'
    ORDER BY absolute_growth DESC
    LIMIT 10;

 * sqlite:///factbook.db
Done.

[('India', 1251695584, 1.22, 15270686.12),
 ('China', 1367485388, 0.45, 6153684.25),
 ('Nigeria', 181562056, 2.45, 4448270.37),
 ('Pakistan', 199085847, 1.46, 2906653.37),
 ('Ethiopia', 99465819, 2.89, 2874562.17),
 ('Bangladesh', 168957745, 1.6, 2703323.92),
 ('United States', 321368864, 0.78, 2506677.14),
 ('Indonesia', 255993674, 0.92, 2355141.8),
 ('Congo, Democratic Republic of the', 79375136, 2.45, 1944690.83),
 ('Philippines', 100998376, 1.61, 1626073.85)]

## Top 10 Water-Land-Ratios

In [35]:
%%sql 
SELECT name,
        ROUND(CAST(area_water AS Float)/CAST(area_land AS Float), 2) AS ratio
    FROM facts
    WHERE name != 'World'
    ORDER BY ratio DESC
    LIMIT 10;

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory', 905.67),
 ('Virgin Islands', 4.52),
 ('Puerto Rico', 0.55),
 ('Bahamas, The', 0.39),
 ('Guinea-Bissau', 0.28),
 ('Malawi', 0.26),
 ('Netherlands', 0.23),
 ('Uganda', 0.22),
 ('Eritrea', 0.16),
 ('Liberia', 0.16)]

## Top 10 Death birth rate ratio

In [10]:
%%sql 
SELECT name,
        ROUND(CAST(death_rate AS Float)/CAST(birth_rate AS Float), 2) AS ratio,
        death_rate, birth_rate
    FROM facts
    WHERE name != 'World'
    ORDER BY ratio DESC
    LIMIT 10;

 * sqlite:///factbook.db
Done.

[('Bulgaria', 1.62, 14.44, 8.92),
 ('Serbia', 1.5, 13.66, 9.08),
 ('Latvia', 1.43, 14.31, 10.0),
 ('Lithuania', 1.41, 14.27, 10.1),
 ('Hungary', 1.39, 12.73, 9.16),
 ('Monaco', 1.39, 9.24, 6.65),
 ('Germany', 1.35, 11.42, 8.47),
 ('Slovenia', 1.35, 11.37, 8.42),
 ('Ukraine', 1.35, 14.46, 10.72),
 ('Saint Pierre and Miquelon', 1.31, 9.72, 7.42)]

## Top 10 population/area ratio

In [16]:
%%sql
SELECT name,
        ROUND(CAST(population AS Float)/CAST(area AS Float), 2) AS ratio
    FROM facts
    ORDER BY ratio DESC
    LImit 10;

 * sqlite:///factbook.db
Done.

[('Macau', 21168.96),
 ('Monaco', 15267.5),
 ('Singapore', 8141.28),
 ('Hong Kong', 6445.04),
 ('Gaza Strip', 5191.82),
 ('Gibraltar', 4876.33),
 ('Bahrain', 1771.86),
 ('Maldives', 1319.64),
 ('Malta', 1310.02),
 ('Bermuda', 1299.93)]